# -*- coding: utf-8 -*-
# @Time    : 2021/1/15 8:56
# @Author  : Naruto
# @Email   : the-naruto@foxmail.com
# @Project : pyQT5-tutorial-code

from PyQt5.QtWidgets import QApplication,QWidget,QMessageBox
from PyQt5.QtGui import QColor
from PyQt5.QtCore import QTimer
import sys
import time
from i2_EyeJump import Ui_Form
'''
木   rgb(34,139,34)
火   rgb(178,34,34)
金   rgb(255,193,37)
水   rgb(0,191,255)
土   rgb(	160,82,45)

self.leftUPBtn.setStyleSheet("QPushButton{background-color:rgb(34,139,34)}")
self.rightUPBtn.setStyleSheet("QPushButton{background-color:rgb(255,193,37)}")
self.leftDownBtn.setStyleSheet("QPushButton{background-color:rgb(178,34,34)}")
self.rightDownBtn.setStyleSheet("QPushButton{background-color:rgb(0,191,255)}")

'''

class EyeJump(QWidget):
    def __init__(self):
        super().__init__()
        self.ui = Ui_Form()
        self.ui.setupUi(self)  # 构造UI界面
        self.initData()
        self.initTime()


    def initData(self):
        # 记录当前时间的小时部分
        self.tm = 0
        # 五行对应颜色
        self.colorDict = {'木':QColor(34,139,34),'火':QColor(178,34,34),
                     '金':QColor(255,193,37),'水':QColor(0,191,255),'土':QColor(160,82,45)}
        # 时间对应结果:属性,左上,左下,右上,右下,多处
        self.timeDict = {23:['水',"水生木，吉，主贵人相助、酒食、桃花","水克火，男凶女吉，男主有烦心事、口舌、烂桃花等,女主利事业婚姻","水泄金，半吉，主有人请你吃饭，但多有事相求等","水旺太过，凶，主破耗钱财、受惊吓、泌尿之疾、婚不利等","水耗土，吉，主得意外之财、桃花等"],
                    0:['水',"水生木，吉，主贵人相助、酒食、桃花","水克火，男凶女吉，男主有烦心事、口舌、烂桃花等,女主利事业婚姻","水泄金，半吉，主有人请你吃饭，但多有事相求等","水旺太过，凶，主破耗钱财、受惊吓、泌尿之疾、婚不利等","水耗土，吉，主得意外之财、桃花等"],
                    1:["土","土耗木，吉，主得田土之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等","土生金，吉，主得财物、贵人相助等","土克水，吉，主提升、重用、桃花等","土旺太过，凶，主见口舌、肠胃之疾等"],
                    2:["土","土耗木，吉，主得田土之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等","土生金，吉，主得财物、贵人相助等","土克水，吉，主提升、重用、桃花等","土旺太过，凶，主见口舌、肠胃之疾等"],
                    3:["木","木旺太过，凶，主见伤灾、是非、肝胆之疾等","木生火，吉，主贵人相助、文上有喜等","木生火，吉，主贵人相助、文上有喜等","木泄水，半吉，主虽有酒食、得财物，但亦有破财之事等","木克土，男凶女吉，男主是非病灾，女主利事业爱情等"],
                    4:["木","木旺太过，凶，主见伤灾、是非、肝胆之疾等","木生火，吉，主贵人相助、文上有喜等","木生火，吉，主贵人相助、文上有喜等","木泄水，半吉，主虽有酒食、得财物，但亦有破财之事等","木克土，男凶女吉，男主是非病灾，女主利事业爱情等"],
                    5:["木","木旺太过，凶，主见伤灾、是非、肝胆之疾、婚不利等","木生火，吉，主贵人相助、文上有喜、桃花等","木耗金，吉，主得钱财、见桃花等","木泄水，半吉，主虽有酒食、得财物，但亦有破财之事等","木克土，女凶男吉，女主是非病灾，男主利事业爱情等"],
                    6:["木","木旺太过，凶，主见伤灾、是非、肝胆之疾、婚不利等","木生火，吉，主贵人相助、文上有喜、桃花等","木耗金，吉，主得钱财、见桃花等","木泄水，半吉，主虽有酒食、得财物，但亦有破财之事等","木克土，女凶男吉，女主是非病灾，男主利事业爱情等"],
                    7:["土","土耗木，吉，主得山野之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等","土生金，吉，主得财物、贵人相助等","土克水，吉，主提升、重用、桃花等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    8:["土","土耗木，吉，主得山野之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等","土生金，吉，主得财物、贵人相助等","土克水，吉，主提升、重用、桃花等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    9:["火","火泄木，半吉，主见文上小喜、亦有身体小恙等","火旺太过，凶，主见官非、火患之事、心血之疾等","火克金，男吉女凶，男利事业、职位等，女主是非、压力等","火耗财，吉，主有得财物之喜、利婚姻感情等","火生土，吉，主贵人助、文上见喜、名气等。"],
                    10:["火","火泄木，半吉，主见文上小喜、亦有身体小恙等","火旺太过，凶，主见官非、火患之事、心血之疾等","火克金，男吉女凶，男利事业、职位等，女主是非、压力等","火耗财，吉，主有得财物之喜、利婚姻感情等","火生土，吉，主贵人助、文上见喜、名气等。"],
                    11:["火","火泄木，半吉，主见文上小喜、亦有身体小恙等","火旺太过，凶，主见官非、火患之事、心血之疾、婚不利等","火克金，女吉男凶，女利事业、职位等，男主是非、压力等","火耗财，吉，主有得财物之喜、利婚姻感情等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    12:["火","火泄木，半吉，主见文上小喜、亦有身体小恙等","火旺太过，凶，主见官非、火患之事、心血之疾、婚不利等","火克金，女吉男凶，女利事业、职位等，男主是非、压力等","火耗财，吉，主有得财物之喜、利婚姻感情等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    13:["土","土耗木，吉，主得园林之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等。","土生金，吉，主得财物、贵人相助等","土克水，凶，主是非、降职、烂桃花等","土旺太过，凶，主见口舌、肠胃之疾等"],
                    14:["土","土耗木，吉，主得园林之财、桃花等","土泄火，半吉，主见操心之事、进退两难之事等。","土生金，吉，主得财物、贵人相助等","土克水，凶，主是非、降职、烂桃花等","土旺太过，凶，主见口舌、肠胃之疾等"],
                    15:["金","金克木，男凶女吉，男主官非、伤灾、手术等，女主晋升、重用、利婚姻感情等","金耗火，吉，主得意外大财、利婚姻感情等","金旺太过，凶，主刑伤、孝服、呼吸系统疾病等","金生水，吉，主贵人相助、得财获利、有酒食等","金泄土，半吉，主购物、买房等之类。"],
                    16:["金","金克木，男凶女吉，男主官非、伤灾、手术等，女主晋升、重用、利婚姻感情等","金耗火，吉，主得意外大财、利婚姻感情等","金旺太过，凶，主刑伤、孝服、呼吸系统疾病等","金生水，吉，主贵人相助、得财获利、有酒食等","金泄土，半吉，主购物、买房等之类。"],
                    17:["金","金克木，女凶男吉，女主官非、伤灾、手术等，男主晋升、重用、利婚姻感情等","金耗火，吉，主得意外大财、利婚姻感情等","金旺太过，凶，主刑伤、孝服、呼吸系统疾病、婚不利等","金生水，吉，主贵人相助、得财获利、有酒食、利婚等","金泄土，半吉，主购物、买房等之类"],
                    18:["金","金克木，女凶男吉，女主官非、伤灾、手术等，男主晋升、重用、利婚姻感情等","金耗火，吉，主得意外大财、利婚姻感情等","金旺太过，凶，主刑伤、孝服、呼吸系统疾病、婚不利等","金生水，吉，主贵人相助、得财获利、有酒食、利婚等","金泄土，半吉，主购物、买房等之类"],
                    19:["土","土耗木，吉，主得屋宇之财、桃花等","土耗木，吉，主得屋宇之财、桃花等","土生金，吉，主得财物、贵人相助等","土克水，凶，主是非、降职、烂桃花等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    20:["土","土耗木，吉，主得屋宇之财、桃花等","土耗木，吉，主得屋宇之财、桃花等","土生金，吉，主得财物、贵人相助等","土克水，凶，主是非、降职、烂桃花等","土旺太过，凶，主见口舌、肠胃之疾等。"],
                    21:["水","水生木，吉，主贵人相助、酒食、桃花等","水克火，女凶女男，女主有烦心事、口舌、烂桃花等，男主利事业婚姻等","水泄金，半吉，主有人请你吃饭，但有钱财付出等","水旺太过，凶，主破耗钱财、受惊吓、泌尿之疾等","水耗土，吉，主得意外之财、桃花等"],
                    22:["水","水生木，吉，主贵人相助、酒食、桃花等","水克火，女凶女男，女主有烦心事、口舌、烂桃花等，男主利事业婚姻等","水泄金，半吉，主有人请你吃饭，但有钱财付出等","水旺太过，凶，主破耗钱财、受惊吓、泌尿之疾等","水耗土，吉，主得意外之财、桃花等"]
                    }
        self.ui.textBrowser.setText("各个地方底色的颜色为对应的五行属性，时间可以编辑，点击对应你眼皮跳的按钮即可看到结果。注：时间只看小时部分。")


    def initTime(self):
        self.timer = QTimer()
        self.setCurtime()
        self.timer.start(1000 * 60)
        self.timer.timeout.connect(self.setCurtime)
        self.ui.lineEdit.textEdited.connect(self.stopTime)

    def on_leftUPBtn_clicked(self):
        self.getSetResult(1)
    def on_leftDownBtn_clicked(self):
        self.getSetResult(2)
    def on_rightUPBtn_clicked(self):
        self.getSetResult(3)
    def on_rightDownBtn_clicked(self):
        self.getSetResult(4)
    def on_mutiBtn_clicked(self):
        self.getSetResult(5)

    def getSetResult(self,pos):
        print(self.tm)
        self.ui.textBrowser.setText(self.timeDict.get(self.tm)[pos])

    def setCurtime(self):
        lt = time.localtime()  # UTC格式当前时区时间
        st = time.strftime("%H:%M", lt)
        self.ui.lineEdit.setText(st)

    def stopTime(self):
        try:
            self.tm = int(self.ui.lineEdit.text().split(':')[0])
            if int(self.ui.lineEdit.text().split(':')[0])<0 or int(self.ui.lineEdit.text().split(':')[0])>23:
                self.ui.textBrowser.setText('请输入24小时制的标准时间,只输入小时也可~')
                return
        except:
            self.ui.textBrowser.setText('请不要瞎输入好吗？输入24小时制的标准时间,只输入小时也可~')
            return

        self.ui.label.setStyleSheet("QLabel{background-color: %s }"%self.colorDict.get(self.timeDict.get(self.tm)[0]).name())
        if self.timer.isActive():
            self.timer.stop()

    # def closeEvent(self,e):
    #     reply = QMessageBox.question(self,"友情提示!","内容来自网络,结果仅供参考!",QMessageBox.Yes,QMessageBox.Yes)

if __name__ == '__main__':
    app = QApplication(sys.argv)
    wind = EyeJump()
    wind.show()
    sys.exit(app.exec_())









'''
%y 两位数的年份表示（00-99）
%Y 四位数的年份表示（000-9999）
%m 月份（01-12）
%d 月内中的一天（0-31）
%H 24小时制小时数（0-23）
%I 12小时制小时数（01-12）
%M 分钟数（00=59）
%S 秒（00-59）
%a 本地简化星期名称
%A 本地完整星期名称
%b 本地简化的月份名称
%B 本地完整的月份名称
%c 本地相应的日期表示和时间表示
%j 年内的一天（001-366）
%p 本地A.M.或P.M.的等价符
%U 一年中的星期数（00-53）星期天为星期的开始
%w 星期（0-6），星期天为星期的开始
%W 一年中的星期数（00-53）星期一为星期的开始
%x 本地相应的日期表示
%X 本地相应的时间表示
%Z 当前时区的名称
%% %号本身
'''







